###features
levels.features.chasm.chasm=\u6DF1\u6E0A
levels.features.chasm.yes=\u662F\u7684\uFF0C\u6211\u77E5\u9053\u6211\u5728\u505A\u4EC0\u4E48
levels.features.chasm.no=\u4E0D\uFF0C\u6211\u6539\u4E3B\u610F\u4E86
levels.features.chasm.jump=\u4F60\u786E\u5B9A\u8981\u8DF3\u5165\u6D1E\u53E3\u4E2D\uFF1F\u4ECE\u8FD9\u4E48\u9AD8\u7684\u5730\u65B9\u6454\u4E0B\u53BB\u4E00\u5B9A\u5F88\u75BC\u3002
levels.features.chasm.ondeath=\u4F60\u843D\u5730\u8FC7\u731B\u6454\u6B7B\u4E86\u2026\u2026
levels.features.chasm.rankings_desc=\u6B7B\u4E8E\u649E\u51FB



###rooms
levels.rooms.special.massgraveroom$bones.name=\u4E71\u846C\u5C97
levels.rooms.special.massgraveroom$bones.desc=\u904D\u5730\u90FD\u662F\u5C38\u9AA8\uFF0C\u8FD9\u91CC\u5230\u5E95\u53D1\u751F\u8FC7\u4EC0\u4E48\uFF1F

levels.rooms.standard.ritualsiteroom$ritualmarker.name=\u4EEA\u5F0F\u6807\u8BB0
levels.rooms.standard.ritualsiteroom$ritualmarker.desc=\u4E3A\u67D0\u79CD\u9ED1\u6697\u4EEA\u5F0F\u800C\u753B\u4E0B\u7684\u6807\u8BB0\u3002\u8721\u70DB\u901A\u5E38\u6446\u5728\u56DB\u4E2A\u89D2\u4E0A\u3002

levels.rooms.special.weakfloorroom$hiddenwell.name=\u8FDC\u5904\u7684\u4E95
levels.rooms.special.weakfloorroom$hiddenwell.desc=\u4F60\u9690\u7EA6\u53EF\u4EE5\u770B\u5230\u6DF1\u5904\u6709\u4E00\u53E3\u4E95\uFF0C\u4E5F\u8BB8\u8FD9\u4E0B\u9762\u6709\u4E9B\u4EC0\u4E48\uFF1F


###traps
levels.traps.alarmtrap.name=\u8B66\u62A5\u9677\u9631
levels.traps.alarmtrap.alarm=\u9677\u9631\u4EA7\u751F\u7684\u5C16\u9510\u7684\u8B66\u62A5\u58F0\u5728\u5730\u7262\u91CC\u56DE\u8361\uFF01
levels.traps.alarmtrap.desc=\u8FD9\u4E2A\u9677\u9631\u770B\u8D77\u6765\u6709\u7740\u80FD\u9020\u6210\u5F88\u5927\u54CD\u52A8\u7684\u673A\u5236\u3002\u89E6\u53D1\u5B83\u5C06\u4F7F\u672C\u5C42\u6240\u6709\u751F\u7269\u5BF9\u8FD9\u91CC\u4EA7\u751F\u8B66\u89C9\u3002

levels.traps.blazingtrap.name=\u7206\u708E\u9677\u9631
levels.traps.blazingtrap.desc=\u8E29\u8FDB\u8FD9\u4E2A\u9677\u9631\u4F1A\u70B9\u71C3\u67D0\u79CD\u6781\u5177\u529B\u91CF\u7684\u5316\u5B66\u6DF7\u5408\u7269\uFF0C\u5BFC\u81F4\u5F88\u5927\u4E00\u5757\u533A\u57DF\u8D77\u706B\u3002

levels.traps.burningtrap.name=\u70C8\u7130\u9677\u9631
levels.traps.burningtrap.desc=\u8E29\u8FDB\u8FD9\u4E2A\u9677\u9631\u4F1A\u70B9\u71C3\u67D0\u79CD\u5316\u5B66\u6DF7\u5408\u7269\uFF0C\u5BFC\u81F4\u9644\u8FD1\u4E00\u5757\u533A\u57DF\u8D77\u706B\u3002

levels.traps.chillingtrap.name=\u5BD2\u6C14\u9677\u9631
levels.traps.chillingtrap.desc=\u88AB\u89E6\u53D1\u65F6\uFF0C\u8FD9\u4E2A\u9677\u9631\u91CC\u7684\u5316\u5B66\u836F\u5242\u4F1A\u8FC5\u901F\u51BB\u7ED3\u9644\u8FD1\u7684\u7A7A\u6C14\u3002

levels.traps.confusiontrap.name=\u81F4\u7729\u6C14\u4F53\u9677\u9631
levels.traps.confusiontrap.desc=\u89E6\u53D1\u8FD9\u4E2A\u9677\u9631\u5C06\u5728\u9644\u8FD1\u91CA\u653E\u51FA\u4E00\u7247\u6DF7\u4E71\u6C14\u4F53\u3002

levels.traps.cursingtrap.name=\u8BC5\u5492\u9677\u9631
levels.traps.cursingtrap.curse=\u4F60\u6B63\u7A7F\u5728\u8EAB\u4E0A\u7684\u88C5\u5907\u90FD\u88AB\u8BC5\u5492\u4E86\uFF01
levels.traps.cursingtrap.desc=\u8FD9\u4E2A\u9677\u9631\u5145\u6EE1\u4E86\u8BC5\u5492\u7684\u529B\u91CF\u3002\u89E6\u53D1\u5B83\u4F1A\u8BC5\u5492\u4F60\u8EAB\u4E0A\u7684\u90E8\u5206\u88C5\u5907\u3002

levels.traps.disarmingtrap.name=\u7F34\u68B0\u9677\u9631
levels.traps.disarmingtrap.disarm=\u4F60\u624B\u4E2D\u7684\u6B66\u5668\u88AB\u4F20\u9001\u8D70\u4E86\uFF01
levels.traps.disarmingtrap.desc=\u8FD9\u4E2A\u9677\u9631\u5305\u542B\u7740\u975E\u5E38\u6709\u9488\u5BF9\u6027\u7684\u4F20\u9001\u9B54\u6CD5\uFF0C\u5B83\u4F1A\u5C06\u89E6\u53D1\u9677\u9631\u7684\u53D7\u5BB3\u8005\u7684\u6B66\u5668\u4F20\u9001\u5230\u5176\u4ED6\u4F4D\u7F6E\u3002

levels.traps.disintegrationtrap.name=\u89E3\u79BB\u9677\u9631
levels.traps.disintegrationtrap.one=\u9677\u9631\u89E3\u79BB\u4E86\u4F60\u7684%s\uFF01
levels.traps.disintegrationtrap.some=\u9677\u9631\u89E3\u79BB\u4E86\u4F60\u7684\u4E00\u4E9B%s\uFF01
levels.traps.disintegrationtrap.ondeath=\u4F60\u88AB\u89E3\u79BB\u9677\u9631\u51FB\u6740\u2026
levels.traps.disintegrationtrap.desc=\u88AB\u89E6\u53D1\u65F6\uFF0C\u8FD9\u4E2A\u9677\u9631\u5C06\u4F1A\u7528\u89E3\u79BB\u5C04\u7EBF\u88AD\u51FB\u79BB\u5B83\u6700\u8FD1\u7684\u76EE\u6807\uFF0C\u9020\u6210\u663E\u8457\u4F24\u5BB3\u7684\u540C\u65F6\u7834\u574F\u7269\u54C1\u3002\n\n\u5E78\u8FD0\u7684\u662F\uFF0C\u89E6\u53D1\u673A\u5173\u5E76\u6CA1\u6709\u88AB\u9690\u85CF\u8D77\u6765\u3002

levels.traps.distortiontrap.name=\u91CD\u6784\u9677\u9631
levels.traps.distortiontrap.desc=\u8FD9\u79CD\u9677\u9631\u7531\u6765\u6E90\u4E0D\u660E\u7684\u5947\u7279\u9B54\u6CD5\u5236\u4F5C\uFF0C\u89E6\u53D1\u540E\u4F1A\u53EC\u5524\u5404\u5F0F\u5404\u6837\u7684\u602A\u7269\u5230\u8FD9\u91CC\u3002

levels.traps.explosivetrap.name=\u7206\u70B8\u9677\u9631
levels.traps.explosivetrap.desc=\u8FD9\u4E2A\u9677\u9631\u5305\u542B\u4E00\u4E9B\u7C89\u72B6\u70B8\u836F\u548C\u4E00\u4E2A\u89E6\u53D1\u673A\u5236\u3002\u6FC0\u6D3B\u5B83\u4F1A\u5BFC\u81F4\u4E00\u5B9A\u8303\u56F4\u7684\u7206\u70B8\u3002

levels.traps.flashingtrap.name=\u95EA\u5149\u9677\u9631
levels.traps.flashingtrap.desc=\u88AB\u89E6\u53D1\u65F6\uFF0C\u8FD9\u4E2A\u9677\u9631\u5C06\u70B9\u71C3\u50A8\u5B58\u5728\u91CC\u9762\u7684\u5F3A\u6548\u95EA\u5149\u7C89\uFF0C\u4F7F\u53D7\u5BB3\u8005\u6682\u65F6\u5931\u660E\uFF0C\u6B8B\u5E9F\uFF0C\u5E76\u53D7\u5230\u4F24\u5BB3\u3002\n\n\u8FD9\u4E2A\u9677\u9631\u7684\u95EA\u5149\u7C89\u50A8\u5907\u663E\u7136\u5F88\u591A\uFF0C\u53EF\u4EE5\u5728\u635F\u574F\u524D\u89E6\u53D1\u5F88\u591A\u6B21\u3002

levels.traps.flocktrap.name=\u7F8A\u7FA4\u9677\u9631
levels.traps.flocktrap.desc=\u4E5F\u8BB8\u662F\u4E2A\u6765\u81EA\u4E00\u4E9B\u4E1A\u4F59\u6CD5\u5E08\u7684\u73A9\u7B11\uFF0C\u89E6\u53D1\u8FD9\u4E2A\u9677\u9631\u5C31\u4F1A\u521B\u9020\u4E00\u7FA4\u9B54\u6CD5\u7EF5\u7F8A\u3002

levels.traps.frosttrap.name=\u51B0\u971C\u9677\u9631
levels.traps.frosttrap.desc=\u88AB\u89E6\u53D1\u65F6\uFF0C\u8FD9\u4E2A\u9677\u9631\u91CC\u7684\u5316\u5B66\u836F\u5242\u4F1A\u8FC5\u901F\u51BB\u7ED3\u9644\u8FD1\u5927\u8303\u56F4\u7684\u7A7A\u6C14\u3002

levels.traps.gatewaytrap.name=\u866B\u6D1E\u9677\u9631
levels.traps.gatewaytrap.desc=\u8FD9\u79CD\u7279\u6B8A\u7684\u4F20\u9001\u9677\u9631\u53EF\u4EE5\u88AB\u53CD\u590D\u6FC0\u6D3B\u5E76\u4E14\u603B\u662F\u901A\u5411\u540C\u6837\u7684\u76EE\u7684\u5730\u3002

levels.traps.geysertrap.name=\u6FC0\u6D41\u9677\u9631
levels.traps.geysertrap.desc=\u88AB\u89E6\u53D1\u65F6\uFF0C\u5927\u91CF\u7684\u6C34\u4F1A\u4ECE\u4E2D\u55B7\u6D8C\u800C\u51FA\uFF0C\u51FB\u9000\u5468\u56F4\u6240\u6709\u89D2\u8272\u5E76\u8986\u76D6\u5468\u906D\u7684\u5730\u5F62\u3002

levels.traps.grimtrap.name=\u5373\u6B7B\u9677\u9631
levels.traps.grimtrap.ondeath=\u4F60\u88AB\u5373\u6B7B\u9677\u9631\u7684\u51B2\u51FB\u5F7B\u5E95\u51FB\u6740\u2026
levels.traps.grimtrap.desc=\u975E\u5E38\u5F3A\u5927\u7684\u7834\u574F\u9B54\u6CD5\u50A8\u5B58\u5728\u8FD9\u4E2A\u9677\u9631\u91CC\uFF0C\u8DB3\u4EE5\u77AC\u95F4\u6740\u6B7B\u9664\u4E86\u72B6\u6001\u6700\u4F73\u7684\u82F1\u96C4\u5916\u7684\u6240\u6709\u751F\u7269\u3002\u89E6\u53D1\u5B83\u5C06\u5411\u6700\u8FD1\u7684\u751F\u7269\u53D1\u9001\u4E00\u4E2A\u81F4\u547D\u7684\u8FDC\u7A0B\u51B2\u51FB\u9B54\u6CD5\u3002\n\n\u5E78\u597D\u7684\u662F\uFF0C\u89E6\u53D1\u673A\u5173\u5E76\u6CA1\u6709\u88AB\u9690\u85CF\u8D77\u6765\u3002

levels.traps.grippingtrap.name=\u6355\u730E\u9677\u9631
levels.traps.grippingtrap.desc=\u89E6\u53D1\u8FD9\u4E2A\u9677\u9631\u5C06\u4F7F\u4E00\u5BF9\u94B3\u5B50\u5408\u4E0A\uFF0C\u4F24\u5BB3\u53D7\u5BB3\u8005\u5E76\u5C06\u4ED6\u4EEC\u56FA\u5B9A\u5728\u8FD9\u91CC\u3002\n\n\u7531\u4E8E\u5176\u7B80\u5355\u7684\u6784\u9020\uFF0C\u8FD9\u79CD\u9677\u9631\u53EF\u88AB\u591A\u6B21\u6FC0\u6D3B\u800C\u4E0D\u635F\u6BC1\u3002

levels.traps.guardiantrap.name=\u5B88\u536B\u8005\u9677\u9631
levels.traps.guardiantrap.alarm=\u9677\u9631\u4EA7\u751F\u7684\u5C16\u9510\u7684\u8B66\u62A5\u58F0\u5728\u5730\u7262\u91CC\u56DE\u8361\uFF01
levels.traps.guardiantrap.desc=\u8FD9\u4E2A\u9677\u9631\u6709\u7740\u5947\u602A\u7684\u9B54\u6CD5\u673A\u5236\uFF0C\u5B83\u5C06\u53EC\u5524\u5B88\u62A4\u8005\u5E76\u5411\u5C06\u4F7F\u672C\u5C42\u6240\u6709\u751F\u7269\u5BF9\u8FD9\u91CC\u4EA7\u751F\u8B66\u89C9\u3002
levels.traps.guardiantrap$guardian.name=\u53EC\u5524\u5B88\u536B
levels.traps.guardiantrap$guardian.desc=\u8FD9\u4E2A\u84DD\u8272\u7684\u5E7B\u5F71\u4F3C\u4E4E\u662F\u53EC\u5524\u51FA\u6765\u7684\u5730\u7262\u91CC\u7684\u77F3\u50CF\u5B88\u536B\u865A\u5F71\u4E4B\u4E00\u3002 \n\n\u5C3D\u7BA1\u96D5\u50CF\u672C\u8EAB\u51E0\u4E4E\u6CA1\u6709\u5F62\u4F53\uFF0C\u4F46\u5B83\u63E1\u7740\u7684_%s_\uFF0C\u770B\u8D77\u6765\u50CF\u662F\u771F\u7684\u3002

levels.traps.oozetrap.name=\u6DE4\u6CE5\u9677\u9631
levels.traps.oozetrap.desc=\u8FD9\u4E2A\u9677\u9631\u5C06\u4F1A\u6D12\u51FA\u8150\u8680\u6027\u7684\u6DE4\u6CE5\uFF0C\u5B83\u5C06\u70E7\u707C\u4F60\u7684\u76AE\u80A4\u76F4\u5230\u88AB\u6D17\u6389\u3002

levels.traps.pitfalltrap.name=\u584C\u65B9\u9677\u9631
levels.traps.pitfalltrap.triggered_hero=\u4F60\u5468\u56F4\u7684\u5730\u677F\u5728\u8FC5\u901F\u5D29\u584C\uFF01
levels.traps.pitfalltrap.triggered=\u9677\u9631\u9644\u8FD1\u7684\u5730\u677F\u5728\u8FC5\u901F\u5D29\u584C\uFF01
levels.traps.pitfalltrap.no_pit=\u8FD9\u91CC\u7684\u5730\u9762\u592A\u7ED3\u5B9E\u4E86\uFF0C\u584C\u65B9\u9677\u9631\u5728\u8FD9\u91CC\u65E0\u6548\u3002
levels.traps.pitfalltrap.desc=\u8FD9\u79CD\u9677\u9631\u4E0E\u4E00\u79CD\u5927\u578B\u6D3B\u677F\u95E8\u88C5\u7F6E\u76F8\u8FDE\uFF0C\u5728\u6FC0\u6D3B\u540E\u4F1A\u4F7F\u5468\u56F4\u7684\u5730\u677F\u8FC5\u901F\u5D29\u584C\uFF01\u4E0D\u8FC7\u8FD9\u7C7B\u9677\u9631\u5728\u575A\u5B9E\u7684\u5730\u9762\u4E0A\u4F1A\u5931\u6548\u3002

levels.traps.poisondarttrap.name=\u6BD2\u9556\u9677\u9631
levels.traps.poisondarttrap.desc=\u9644\u8FD1\u4E00\u5B9A\u85CF\u7740\u4E00\u4E2A\u5C0F\u578B\u98DE\u9556\u53D1\u5C04\u5668\uFF0C\u6FC0\u6D3B\u8FD9\u4E2A\u9677\u9631\u4F1A\u5BFC\u81F4\u5B83\u5411\u6700\u8FD1\u7684\u76EE\u6807\u5C04\u51FA\u4E00\u4E2A\u6BD2\u9556\u3002\n\n\u5E78\u597D\u7684\u662F\uFF0C\u89E6\u53D1\u673A\u5173\u5E76\u6CA1\u6709\u88AB\u9690\u85CF\u8D77\u6765\u3002

levels.traps.rockfalltrap.name=\u843D\u77F3\u9677\u9631
levels.traps.rockfalltrap.ondeath=\u4F60\u88AB\u843D\u77F3\u7838\u6241\u4E86\u2026\u2026
levels.traps.rockfalltrap.desc=\u8FD9\u4E2A\u9677\u9631\u548C\u5934\u9876\u4E0A\u4E00\u7247\u677E\u6563\u7684\u5CA9\u77F3\u76F8\u8FDE\uFF0C\u89E6\u53D1\u5B83\u4F1A\u5BFC\u81F4\u77F3\u5757\u5D29\u584C\u7838\u5411\u6574\u4E2A\u623F\u95F4\uFF01\u5982\u679C\u8FD9\u79CD\u9677\u9631\u4E0D\u662F\u5728\u67D0\u4E2A\u623F\u95F4\u5185\uFF0C\u77F3\u5757\u4F1A\u7838\u5411\u9677\u9631\u5468\u56F4\u7684\u4E00\u5B9A\u533A\u57DF\u3002\n\n\u5E78\u8FD0\u7684\u662F\uFF0C\u89E6\u53D1\u673A\u5173\u5E76\u6CA1\u6709\u88AB\u9690\u85CF\u8D77\u6765\u3002

levels.traps.shockingtrap.name=\u7535\u51FB\u9677\u9631
levels.traps.shockingtrap.desc=\u4E00\u79CD\u50A8\u5B58\u7740\u5927\u91CF\u7535\u80FD\u7684\u673A\u5173\u3002\u89E6\u53D1\u8FD9\u4E2A\u9677\u9631\u4F1A\u8BA9\u5B83\u628A\u80FD\u91CF\u91CA\u653E\u51FA\u6765\u5728\u9644\u8FD1\u5F62\u6210\u5C0F\u8303\u56F4\u7684\u7535\u80FD\u573A\u3002

levels.traps.stormtrap.name=\u96F7\u66B4\u9677\u9631
levels.traps.stormtrap.desc=\u4E00\u79CD\u50A8\u5B58\u7740\u5E9E\u5927\u7535\u80FD\u7684\u673A\u5173\u3002\u89E6\u53D1\u8FD9\u4E2A\u9677\u9631\u4F1A\u8BA9\u5B83\u628A\u80FD\u91CF\u91CA\u653E\u51FA\u6765\u5F62\u6210\u5927\u8303\u56F4\u7684\u96F7\u7535\u98CE\u66B4\u3002

levels.traps.summoningtrap.name=\u53EC\u5524\u9677\u9631
levels.traps.summoningtrap.desc=\u89E6\u53D1\u8FD9\u4E2A\u9677\u9631\u5C06\u53EC\u5524\u672C\u533A\u57DF\u7684\u4E00\u4E9B\u602A\u7269\u5230\u8FD9\u91CC\u3002

levels.traps.teleportationtrap.name=\u4F20\u9001\u9677\u9631
levels.traps.teleportationtrap.desc=\u5F53\u8FD9\u79CD\u9677\u9631\u88AB\u89E6\u53D1\u65F6\uFF0C\u5176\u5468\u906D\u7684\u6240\u6709\u4E1C\u897F\u90FD\u4F1A\u88AB\u5404\u81EA\u4F20\u9001\u5230\u672C\u5C42\u7684\u968F\u673A\u5730\u70B9\u3002

levels.traps.tengudarttrap.desc=\u663E\u7136\uFF0C\u5929\u72D7\u505A\u4E86\u5145\u5206\u7684\u6218\u6597\u51C6\u5907\u3002\u8FD9\u4E2A\u9677\u9631\u4F1A\u6FC0\u6D3B\u4E00\u4E2A\u9690\u85CF\u7684\u98DE\u9556\u53D1\u5C04\u5668\uFF0C\u5411\u8DDD\u79BB\u6700\u8FD1\u4E14\u4E0D\u662F\u5929\u72D7\u7684\u5355\u4F4D\u53D1\u5C04\u4E00\u679A\u6BD2\u9556\u3002\n\n\u9677\u9631\u7684\u5236\u9020\u6280\u5DE7\u6781\u5176\u9AD8\u6DF1\uFF0C\u4E0D\u4F7F\u7528\u9B54\u6CD5\u624B\u6BB5\u7684\u8BDD\uFF0C\u89E6\u53D1\u88C5\u7F6E\u5B8C\u5168\u65E0\u6CD5\u627E\u5230\u3002\u4E0D\u8FC7\u9677\u9631\u5728\u521A\u88AB\u5E03\u7F6E\u7684\u77ED\u65F6\u95F4\u5185\u662F\u53EF\u4EE5\u7528\u8089\u773C\u89C2\u5BDF\u5230\u7684\u3002

levels.traps.toxictrap.name=\u6BD2\u6C14\u9677\u9631
levels.traps.toxictrap.desc=\u89E6\u53D1\u8FD9\u4E2A\u9677\u9631\u5C06\u653E\u51FA\u4E00\u7247\u6709\u6BD2\u6C14\u4F53\u5230\u8FD9\u9644\u8FD1\u3002

levels.traps.trap.rankings_desc=\u6B7B\u4E8E%s

levels.traps.corrosiontrap.name=\u9178\u8680\u6C14\u4F53\u9677\u9631
levels.traps.corrosiontrap.desc=\u89E6\u53D1\u8FD9\u4E2A\u9677\u9631\u5C06\u5728\u9644\u8FD1\u91CA\u653E\u51FA\u4E00\u7247\u81F4\u547D\u7684\u5F3A\u9178\u6027\u96FE\u6C14\u3002

levels.traps.warpingtrap.name=\u626D\u66F2\u9677\u9631
levels.traps.warpingtrap.desc=\u8FD9\u79CD\u9677\u9631\u548C\u4F20\u9001\u9677\u9631\u9887\u4E3A\u76F8\u4F3C\uFF0C\u4E0D\u8FC7\u5B83\u8FD8\u4F1A\u5BFC\u81F4\u82F1\u96C4\u5FD8\u5374\u672C\u5C42\u7684\u5730\u56FE\u4E0E\u5404\u79CD\u4E1C\u897F\u7684\u65B9\u4F4D\uFF01

levels.traps.weakeningtrap.name=\u865A\u5F31\u9677\u9631
levels.traps.weakeningtrap.desc=\u9677\u9631\u4E2D\u7684\u9ED1\u6697\u9B54\u6CD5\u80FD\u591F\u5438\u53D6\u4EFB\u4F55\u63A5\u89E6\u7269\u91CC\u7684\u80FD\u91CF\uFF0C\u4E0D\u8FC7\u5F3A\u5927\u7684\u654C\u4EBA\u80FD\u62B5\u6297\u8FD9\u79CD\u6548\u679C\u3002

levels.traps.worndarttrap.name=\u8001\u5316\u7684\u98DE\u9556\u9677\u9631
levels.traps.worndarttrap.desc=\u9644\u8FD1\u4E00\u5B9A\u85CF\u7740\u4E00\u4E2A\u5C0F\u578B\u98DE\u9556\u53D1\u5C04\u5668\uFF0C\u6FC0\u6D3B\u8FD9\u4E2A\u9677\u9631\u4F1A\u5BFC\u81F4\u5B83\u5411\u6700\u8FD1\u7684\u76EE\u6807\u5C04\u51FA\u4E00\u4E2A\u98DE\u9556\u3002\n\n\u5E74\u4E45\u5931\u4FEE\u5BFC\u81F4\u5B83\u5E76\u4E0D\u600E\u4E48\u5371\u9669\uFF0C\u89E6\u53D1\u673A\u5173\u751A\u81F3\u6CA1\u6709\u88AB\u9690\u85CF\u8D77\u6765\u2026\u2026



###levels
levels.cavesbosslevel.wires_name=\u5730\u8868\u5BFC\u7EBF
levels.cavesbosslevel.wires_desc=\u88AB\u6316\u6398\u7684\u5730\u9762\u4E0A\u9732\u51FA\u7C97\u5927\u7684\u5BFC\u7EBF\uFF0C\u8FD9\u4E9B\u5BFC\u7EBF\u8FDE\u63A5\u7740\u5468\u56F4\u7684\u7535\u529B\u88C5\u7F6E\u3002\n\n\u5BFC\u7EBF\u4E2D\u4E00\u5B9A\u6709\u7535\u6D41\u6D41\u8FC7\u3002DM-300\u7ECF\u8FC7\u65F6\u53EF\u80FD\u4F1A\u4ECE\u5BFC\u7EBF\u4E2D\u6C72\u53D6\u4E00\u4E9B\u80FD\u91CF\u3002
levels.cavesbosslevel.energy_desc=\u8FD9\u91CC\u7684\u5730\u9762\u95EA\u70C1\u7740\u7535\u706B\u82B1\uFF0C\u76F4\u63A5\u8E29\u4E0A\u53BB\u4F1A\u89E6\u7535\u3002\u7535\u706B\u82B1\u4F3C\u4E4E\u90FD\u5728\u671D\u5411\u67D0\u4E2A\u4F4D\u7F6E... \u4E5F\u8BB8\u5B83\u4EEC\u6307\u5411\u7535\u6E90\uFF1F
levels.cavesbosslevel.gate_name=\u91D1\u5C5E\u57CE\u95E8
levels.cavesbosslevel.gate_desc=\u4E00\u9762\u9AD8\u5927\u7684\u91D1\u5C5E\u57CE\u95E8\u6321\u4F4F\u4E86\u901A\u5F80\u77EE\u4EBA\u57CE\u5E02\u7684\u9053\u8DEF\u3002\u95E8\u4E2D\u95F4\u7684\u91D1\u5C5E\u76D2\u55E1\u55E1\u4F5C\u54CD\uFF0C\u60F3\u5FC5\u662F\u4E0E\u9644\u8FD1\u7684\u7535\u8DEF\u4E0E\u8BBE\u5907\u76F8\u8FDE\u3002\u4E5F\u8BB8\u51FB\u8D25DM-300\u80FD\u5F00\u542F\u8FD9\u6247\u5927\u95E8\uFF1F
levels.cavesbosslevel.gate_desc_broken=\u8FD9\u6247\u5927\u95E8\u4E00\u5B9A\u662F\u4EE5\u67D0\u79CD\u5F62\u5F0F\u4E0EDM-300\u76F8\u8FDE\uFF0C\u56E0\u4E3A\u5728DM-300\u635F\u574F\u65F6\u5B83\u4E5F\u968F\u4E4B\u7206\u70B8\u3002\u73B0\u5728\u8FD9\u6247\u95E8\u70B8\u5F97\u53EA\u5269\u4E0B\u96F6\u661F\u7684\u788E\u7247\u3002
levels.cavesbosslevel.water_desc=\u5468\u56F4\u5954\u6D8C\u7740\u5F3A\u5927\u7684\u7535\u6D41\uFF0C\u8FD9\u91CC\u7684\u6C34\u53EF\u80FD\u4E0D\u592A\u5B89\u5168...

levels.citybosslevel.throne_name=\u738B\u5EA7
levels.citybosslevel.throne_desc=\u8FD9\u5EA7\u9192\u76EE\u7684\u9AD8\u5927\u738B\u5EA7\u66FE\u662F\u77EE\u4EBA\u56FD\u738B\u7684\u5E2D\u4F4D\uFF0C\u4F46\u73B0\u5728\u5B83\u5DF2\u5C5E\u4E8E\u4E00\u4F4D\u6C89\u6E4E\u4E8E\u529B\u91CF\u7684\u6B7B\u7075\u6CD5\u5E08\u3002\n\n\u8BF4\u4E0D\u6E05\u662F\u4E0D\u662F\u6709\u4EC0\u4E48\u9B54\u6CD5\u6216\u662F\u673A\u68B0\u88C5\u7F6E\u4E0E\u738B\u5EA7\u76F8\u8FDE\uFF0C\u77EE\u4EBA\u56FD\u738B\u5728\u4E0A\u9762\u5750\u7740\u65F6\u4F1A\u62E5\u6709\u989D\u5916\u7684\u80FD\u529B\u3002
levels.citybosslevel.summoning_name=\u5524\u7075\u57FA\u5EA7
levels.citybosslevel.summoning_desc=\u5524\u7075\u57FA\u5EA7\u7684\u4E2D\u592E\u6709\u4E00\u4E2A\u5DE8\u5927\u7684\u5F00\u53E3\uFF0C\u65F6\u4E0D\u65F6\u6D8C\u51FA\u4E00\u4E9B\u9ED1\u6697\u80FD\u91CF\u3002\n\n\u77EE\u4EBA\u56FD\u738B\u5229\u7528\u8FD9\u4E9B\u57FA\u5EA7\u6765\u805A\u7126\u6B7B\u7075\u9B54\u6CD5\uFF0C\u4E3A\u5176\u53EC\u5524\u5974\u4EC6\u3002\u53EC\u5524\u7269\u7684\u751F\u6210\u9700\u8981\u4E00\u6BB5\u65F6\u95F4\u7684\u80FD\u91CF\u805A\u96C6\uFF0C\u53EC\u5524\u7269\u7684\u7C7B\u578B\u53D6\u51B3\u4E8E\u805A\u79EF\u4E8E\u6B64\u7684\u9B54\u529B\u3002

levels.caveslevel.grass_name=\u8367\u5149\u5730\u82D4
levels.caveslevel.high_grass_name=\u8367\u5149\u83CC\u83C7
levels.caveslevel.water_name=\u51B0\u6F88\u6C34\u6F6D
levels.caveslevel.entrance_desc=\u901A\u5411\u4E0A\u4E00\u5C42\u7684\u68AF\u5B50\u3002
levels.caveslevel.exit_desc=\u901A\u5411\u4E0B\u4E00\u5C42\u7684\u68AF\u5B50\u3002
levels.caveslevel.high_grass_desc=\u9AD8\u8038\u7684\u83CC\u83C7\u7FA4\u906E\u6321\u4E86\u4F60\u7684\u89C6\u7EBF\u3002
levels.caveslevel.wall_deco_desc=\u5CA9\u58C1\u4E0A\u80FD\u9690\u7EA6\u770B\u89C1\u91D1\u5C5E\u77FF\u8109\u7684\u7EB9\u8DEF\uFF0C\u96BE\u9053\u662F\u91D1\u5B50\uFF1F
levels.caveslevel.bookshelf_desc=\u5230\u5E95\u4F1A\u6709\u8C01\u9700\u8981\u5728\u6D1E\u7A9F\u91CC\u6446\u4E0A\u8FD9\u4E48\u4E2A\u4E66\u67B6\uFF1F

levels.citylevel.closed_door_name=\u5173\u7740\u76842233
levels.citylevel.water_name=\u5F02\u8272\u6C34\u6F6D
levels.citylevel.high_grass_name=\u8302\u76DB\u82B1\u6735
levels.citylevel.entrance_desc=\u901A\u5411\u4E0A\u4E00\u5C42\u7684\u659C\u5761\u3002
levels.citylevel.exit_desc=\u901A\u5411\u4E0B\u4E00\u5C42\u7684\u659C\u5761\u3002
levels.citylevel.deco_desc=\u8FD9\u91CC\u5C11\u4E86\u4E00\u4E9B\u5730\u7816\u3002
levels.citylevel.sp_desc=\u539A\u5730\u6BEF\u8986\u76D6\u7740\u5730\u677F\u3002
levels.citylevel.statue_desc=\u8FD9\u5EA7\u96D5\u50CF\u523B\u753B\u51FA\u4E86\u4E00\u4F4D\u6446\u51FA\u82F1\u52C7\u59FF\u6001\u7684\u77EE\u4EBA\u3002
levels.citylevel.bookshelf_desc=\u4E0D\u540C\u5B66\u79D1\u7684\u4E66\u6392\u6EE1\u4E86\u4E66\u67B6\u3002

levels.hallslevel.water_name=\u4F4E\u6E29\u5CA9\u6D46
levels.hallslevel.grass_name=\u4F59\u70EC\u5730\u82D4
levels.hallslevel.high_grass_name=\u4F59\u70EC\u83CC\u83C7
levels.hallslevel.statue_name=\u53F0\u67F1
levels.hallslevel.water_desc=\u770B\u8D77\u6765\u5982\u540C\u5CA9\u6D46\u4E00\u822C\uFF0C\u4E0D\u8FC7\u6CA1\u6709\u611F\u53D7\u5230\u70ED\u5EA6\uFF0C\u5E94\u8BE5\u53EF\u4EE5\u78B0\u89E6\u3002
levels.hallslevel.statue_desc=\u8FD9\u4E2A\u67F1\u5B50\u7531\u7C7B\u4EBA\u751F\u7269\u5934\u9AA8\u5792\u6210\u3002\u771F\u5E05\u3002
levels.hallslevel.bookshelf_desc=\u7528\u8FDC\u53E4\u8BED\u8A00\u5199\u5C31\u7684\u4E66\u7C4D\u5806\u79EF\u5728\u4E66\u67B6\u91CC\u3002

levels.level.hidden_trap=\u4E00\u4E2A\u9690\u85CF\u7684%s\u88AB\u89E6\u53D1\u4E86\uFF01
levels.level.chasm_name=\u6DF1\u6E0A
levels.level.floor_name=\u5730\u677F
levels.level.grass_name=\u8349
levels.level.water_name=\u6C34\u6F6D
levels.level.wall_name=\u5899\u58C1
levels.level.closed_door_name=\u5173\u7740\u7684\u95E8
levels.level.open_door_name=\u5F00\u7740\u7684\u95E8
levels.level.entrace_name=\u697C\u5C42\u5165\u53E3
levels.level.exit_name=\u697C\u5C42\u51FA\u53E3
levels.level.embers_name=\u4F59\u70EC
levels.level.furrowed_grass_name=\u67AF\u840E\u7684\u690D\u88AB
levels.level.locked_door_name=\u9501\u7740\u7684\u95E8
levels.level.pedestal_name=\u57FA\u5EA7
levels.level.barricade_name=\u8DEF\u969C
levels.level.high_grass_name=\u9AD8\u8349
levels.level.locked_exit_name=\u9501\u7740\u7684\u697C\u5C42\u51FA\u53E3
levels.level.unlocked_exit_name=\u5F00\u653E\u7684\u697C\u5C42\u51FA\u53E3
levels.level.sign_name=\u544A\u793A\u724C
levels.level.well_name=\u4E95
levels.level.empty_well_name=\u5E72\u6DB8\u7684\u4E95
levels.level.statue_name=\u96D5\u50CF
levels.level.inactive_trap_name=\u5DF2\u89E6\u53D1\u7684\u9677\u9631
levels.level.bookshelf_name=\u4E66\u67B6
levels.level.alchemy_name=\u70BC\u836F\u9505
levels.level.default_name=???
levels.level.chasm_desc=\u4F60\u770B\u4E0D\u5230\u5E95\u3002
levels.level.water_desc=\u8FDB\u5165\u6C34\u6F6D\u4E2D\u53EF\u7184\u706D\u8EAB\u4E0A\u7684\u706B\u7130\u3002
levels.level.entrance_desc=\u901A\u5411\u4E0A\u4E00\u5C42\u7684\u697C\u68AF\u3002
levels.level.exit_desc=\u697C\u68AF\u4E00\u7EA7\u7EA7\u5411\u4E0B\u5EF6\u4F38\u3002
levels.level.embers_desc=\u5730\u4E0A\u6563\u843D\u7740\u71C3\u5C3D\u7684\u4F59\u7070\u3002
levels.level.high_grass_desc=\u8302\u5BC6\u7684\u690D\u88AB\u906E\u6321\u4E86\u4F60\u7684\u89C6\u7EBF\u3002
levels.level.locked_door_desc=\u8FD9\u6247\u95E8\u9501\u7740\uFF0C\u800C\u4F60\u9700\u8981\u5339\u914D\u7684\u94A5\u5319\u624D\u80FD\u6253\u5F00\u5B83\u3002
levels.level.locked_exit_desc=\u6C89\u91CD\u7684\u94C1\u680F\u6746\u5C01\u9501\u4F4F\u4E86\u901A\u5F80\u4E0B\u4E00\u5C42\u7684\u697C\u68AF\u3002
levels.level.barricade_desc=\u6728\u6805\u680F\u4F9D\u7136\u575A\u56FA\uFF0C\u4F46\u65E9\u5DF2\u98CE\u5E72\u591A\u5E74\u3002\u70E7\u4E86\u600E\u4E48\u6837\uFF1F
levels.level.sign_desc=\u8FD9\u4E2A\u8DDD\u79BB\u4F60\u65E0\u6CD5\u770B\u6E05\u4E0A\u9762\u7684\u6587\u5B57\u3002
levels.level.inactive_trap_desc=\u8FD9\u4E2A\u9677\u9631\u5DF2\u7ECF\u88AB\u89E6\u53D1\u8FC7\u4E86\uFF0C\u73B0\u5728\u4E00\u70B9\u4E5F\u4E0D\u5371\u9669\u3002
levels.level.statue_desc=\u6709\u4EBA\u60F3\u88C5\u9970\u4E00\u4E0B\u8FD9\u91CC\uFF0C\u5F88\u663E\u7136\uFF0C\u5B83\u6CA1\u80FD\u6210\u529F\u2026
levels.level.alchemy_desc=\u8FD9\u53E3\u70BC\u91D1\u91DC\u4E2D\u5145\u6EE1\u4E86\u9B54\u529B\u4E4B\u6C34\u3002\u7269\u54C1\u53EF\u4EE5\u5728\u91CC\u9762\u5171\u70BC\u4EE5\u5236\u9020\u65B0\u7684\u7269\u54C1\u3002
levels.level.empty_well_desc=\u8FD9\u5EA7\u4E95\u5DF2\u7ECF\u67AF\u7AED\u4E86\u3002

levels.prisonlevel.water_name=\u9EEF\u51B7\u6C34\u6F6D
levels.prisonlevel.empty_deco_desc=\u5176\u4E0A\u4ECD\u6B8B\u7559\u7740\u5E72\u6DB8\u7684\u8840\u8FF9\u3002
levels.prisonlevel.bookshelf_desc=\u8FD9\u4E2A\u4E66\u67B6\u53EF\u80FD\u662F\u76D1\u72F1\u56FE\u4E66\u9986\u7684\u6B8B\u7559\u7269\u3002\u70E7\u6389\u600E\u4E48\u6837\uFF1F

levels.sewerlevel.water_name=\u6D51\u6D4A\u6C34\u6F6D
levels.sewerlevel.empty_deco_desc=\u6F6E\u6E7F\u4E14\u53D1\u9EC4\u7684\u82D4\u85D3\u8986\u76D6\u5176\u4E0A\u3002
levels.sewerlevel.bookshelf_desc=\u8FD9\u4E2A\u4E66\u67B6\u585E\u6EE1\u4E86\u6CA1\u7528\u7684\u6210\u529F\u5B66\u4E66\u7C4D\u3002\u70E7\u6389\u600E\u4E48\u6837\uFF1F


levels.arealevel.sandarealevel.water_name=\u6D51\u6D4A\u7684\u6C34
levels.arealevel.sandarealevel.water_desc=\u6C99\u6F20\u4E2D\u5C11\u5F97\u53EF\u601C\u7684\u6C34\u6E90\uFF0C\u7136\u800C\u65E9\u5DF2\u53D8\u5F97\u6D51\u6D4A\u4E0D\u582A

levels.arealevel.sandarealevel.door_name=\u98CE\u6C99\u906E\u63A9\u7684\u95E8
levels.arealevel.sandarealevel.door_desc=\u4F60\u8D39\u4E86\u597D\u5927\u7684\u52B2\u624D\u80FD\u52C9\u5F3A\u5206\u8FA8\u51FA\u8FD9\u662F\u4E00\u6247\u95E8\uFF0C\u5F53\u4F60\u6447\u52A8\u8FD9\u6247\u95E8\u65F6\u4F1A\u6709\u5927\u91CF\u7684\u6C99\u5B50\u6389\u4E0B\u6765\uFF0C\u771F\u7CDF\u5FC3

levels.arealevel.sandarealevel.entrance_name=\u4E0A\u697C\u68AF
levels.arealevel.sandarealevel.entrance_desc=\u4E00\u4E2A\u87BA\u65CB\u5F62\u72B6\u7684\u697C\u68AF\u53F3\u4E0A\u65B9\u76D8\u65CB\u800C\u4E0B\uFF0C\u6216\u8BB8\u4F60\u53EF\u4EE5\u4F9D\u9760\u8FD9\u73A9\u610F\u6765\u56DE\u5230\u4E0A\u4E00\u5C42

levels.arealevel.sandarealevel.exit_name=\u4E0B\u697C\u68AF
levels.arealevel.sandarealevel.exit_desc=\u4E00\u4E2A\u87BA\u65CB\u5F62\u72B6\u7684\u697C\u68AF\u901A\u5F80\u66F4\u6DF1\u5904\u7684\u5730\u65B9\uFF0C\u5728\u4E0A\u9762\u884C\u8D70\u7684\u65F6\u5019\u8981\u5C0F\u5FC3\u88AB\u6C99\u5B50\u6ED1\u5012

levels.arealevel.sandarealevel.grass_name=\u987D\u5F3A\u7684\u8349\u6839
levels.arealevel.sandarealevel.grass_desc=\u4E00\u4E9B\u77ED\u5C0F\u800C\u624E\u624B\u7684\u8349\u5728\u8FD9\u91CC\u751F\u957F\u7740\uFF0C\u8FD9\u662F\u4F60\u80FD\u5728\u6C99\u6F20\u4E2D\u89C1\u5230\u7684\u4E3A\u6570\u4E0D\u591A\u7684\u7EFF\u610F

levels.arealevel.sandarealevel.high_grass_name=\u7626\u5F31\u7684\u9AD8\u8349
levels.arealevel.sandarealevel.high_grass_desc=\u4E00\u4E9B\u534A\u5E72\u67AF\u4E14\u4ECD\u7136\u4FDD\u6301\u7740\u7EFF\u610F\u7684\u9AD8\u8349\uFF0C\u6216\u8BB8\u518D\u8FC7\u4E00\u6BB5\u65F6\u95F4\u4ED6\u4EEC\u5C31\u4F1A\u5F7B\u5E95\u5012\u4E0B

levels.arealevel.sandarealevel.wall_name=\u6C99\u5899
levels.arealevel.sandarealevel.wall_desc=\u6709\u5927\u91CF\u7684\u7802\u5CA9\u7EC4\u5408\u800C\u6210\u7684\u5899\u58C1\uFF0C\u7531\u4E8E\u53D7\u5230\u5730\u7262\u80FD\u91CF\u7684\u6CBE\u67D3\u4ECE\u800C\u51FA\u5947\u5730\u7ED3\u5B9E

levels.arealevel.sandarealevel.bookshelf_name=\u79EF\u6C99\u4E66\u67B6
levels.arealevel.sandarealevel.bookshelf_desc=\u4E00\u4E2A\u6BD4\u8F83\u53E4\u6734\u7684\u4E66\u67B6\uFF0C\u4E0A\u9762\u8986\u76D6\u4E86\u4E00\u5C42\u539A\u91CD\u7684\u6C99\u5B50

